{
  "slug": "experience",
  "title": "Three Years in Healthcare: Looking Back",
  "subtitle": "The journey from teaching code to leading product strategy",
  "step": 7,
  "totalSteps": 7,
  "prevSlug": "philosophy",
  "prevLabel": "Back: Product Philosophy",
  "sections": [
    {
      "type": "heading",
      "level": 2,
      "content": "The Evolution"
    },
    {
      "type": "paragraph",
      "content": "I didn't plan to become a product manager. I started as a coding bootcamp instructor, became a full-stack engineer, and gradually realized my highest impact wasn't writing code—it was asking better questions before anyone wrote code."
    },
    {
      "type": "paragraph",
      "content": "At LEARN Academy, I learned that **documentation is a product**. Teaching 170+ students forced me to explain complex technical concepts simply. Now, I write documentation that engineers actually read—because I know how to structure information for technical consumption."
    },
    {
      "type": "paragraph",
      "content": "At Rugiet Health, I had my 'Technical PM moment.' When retention dropped, I didn't just ask for a feature. I analyzed the database schema and realized our subscription model was too rigid. I mapped out the data model changes required to support a 'Pause' state, proving that a small engineering lift could solve a massive business problem (35% retention increase)."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "Why Healthcare?"
    },
    {
      "type": "callout",
      "variant": "blue",
      "content": "Healthcare technology isn't just another SaaS domain. It requires deep operational understanding, technical rigor, and stakeholder translation. Three years in telehealth has taught me that healthcare PM isn't about shipping fast—it's about shipping right."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "What Defines My Approach"
    },
    {
      "type": "metrics",
      "content": [
        "🎯 <strong>Outcomes-Driven</strong> — I measure success by problems solved and value created. A 35% retention increase matters more than 10 new features.",
        "🔧 <strong>Technical Depth</strong> — I read code, understand data models, and write specs developers can implement without 10 rounds of clarification.",
        "⚙️ <strong>Operational Obsession</strong> — I design for the operational reality, not the ideal state. Clinical workflows matter more than beautiful UI."
      ]
    }
  ]
}