{
  "slug": "learn-academy",
  "title": "LEARN Academy: Where It All Started",
  "subtitle": "Student (May-Aug 2020) • Instructor (2021-2023) • Lead Instructor (Jan 2022)",
  "step": 1,
  "totalSteps": 6,
  "nextSlug": "rugiet",
  "nextLabel": "Next: Rugiet Health",
  "sections": [
    {
      "type": "heading",
      "level": 2,
      "content": "The Career Transition"
    },
    {
      "type": "paragraph",
      "content": "In May 2020, during the COVID lockdown, I made a decision: I was going to leave Philz Coffee and transition into tech. I enrolled at LEARN Academy as a student, and four months later I graduated with full-stack development skills."
    },
    {
      "type": "paragraph",
      "content": "By 2021, I was back—this time as an instructor. On January 1, 2022, I became a Lead Instructor. Over three years, I taught 170+ students to code, but more importantly, I taught them how to think like engineers and communicate technical concepts clearly."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "What I Learned from Teaching"
    },
    {
      "type": "list",
      "content": [
        "<strong>Translating Complexity:</strong> Teaching forced me to understand concepts deeply enough to explain them simply. This skill now helps me bridge engineers, clinicians, and business stakeholders.",
        "<strong>Pattern Recognition:</strong> Seeing 170+ students learn to code taught me to identify common misconceptions and design solutions that prevent confusion.",
        "<strong>Documentation Matters:</strong> Students couldn't succeed without clear documentation. Now I write specs that engineers can implement without constant clarification.",
        "<strong>Mentorship & Leadership:</strong> Managing cohorts, coordinating with instructors, and supporting students built leadership skills that translate directly to cross-functional product teams."
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "content": "The AI Prediction (2022)"
    },
    {
      "type": "callout",
      "variant": "blue",
      "title": "A Prediction That Aged Well",
      "content": "As Lead Instructor starting January 2022, I made a controversial choice: I emphasized pseudocode, problem-solving, and technical communication over syntax memorization. My reasoning? I believed AI would make hand-coding obsolete within five years."
    },
    {
      "type": "paragraph",
      "content": "In 2022, this was a bold claim. GitHub Copilot had just launched, but most developers dismissed AI as a novelty. I disagreed. I saw the trajectory and bet that the most valuable skill wouldn't be writing code—it would be knowing what code to write and how to communicate technical requirements."
    },
    {
      "type": "callout",
      "variant": "green",
      "content": "Three years later, in 2025, Claude Code, Cursor, and AI-powered development tools are proving that prediction right. The students who learned to think algorithmically and explain problems clearly have a massive advantage over those who just memorized syntax."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "The Technical Foundation"
    },
    {
      "type": "paragraph",
      "content": "Teaching full-stack development meant staying current with modern web technologies. I taught:"
    },
    {
      "type": "callout",
      "variant": "gray",
      "content": [
        "React, JavaScript, Ruby on Rails",
        "Database design and SQL",
        "API integration and RESTful architecture",
        "Git, GitHub, deployment workflows",
        "Testing, debugging, and problem-solving methodologies"
      ]
    },
    {
      "type": "paragraph",
      "content": "This technical foundation became essential when I moved into healthcare engineering and product management. I can read code, understand data models, and write implementable specs because I taught these concepts for three years."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "Impact"
    },
    {
      "type": "metrics",
      "content": [
        "👨‍🎓 <strong>Students Trained:</strong> 170+ developers across 12 cohorts",
        "🎯 <strong>Success Rate:</strong> 85%+ graduation rate",
        "💼 <strong>Career Outcomes:</strong> Students placed at Microsoft, Amazon, startups",
        "🌟 <strong>Personal Growth:</strong> Discovered passion for technical leadership and mentorship"
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "content": "Why This Matters"
    },
    {
      "type": "callout",
      "variant": "green",
      "content": "Teaching gave me superpowers for product management: I can explain technical complexity to non-technical stakeholders, write clear documentation, mentor engineers, and design solutions that account for how people actually think and work."
    },
    {
      "type": "paragraph",
      "content": "Everything I do in product management traces back to lessons learned in the classroom. Technical depth + communication skills + empathy for learners = effective product leadership."
    }
  ]
}
